
###  Terraform Plan Summary 

####  Init: success
####  Validate: success
####  Plan: success

<details><summary> Show Terraform Plan</summary>

```hcl
module.ecr_repositories.data.aws_partition.current: Reading...
data.aws_partition.current: Reading...
module.vpc-flowlog-bucket.data.aws_partition.current: Reading...
data.aws_iam_policy_document.flow_log_s3: Reading...
module.ecr_repositories.data.aws_caller_identity.current: Reading...
module.vpn_credential_bucket.data.aws_region.current: Reading...
module.vpc-flowlog-bucket.data.aws_region.current: Reading...
module.ecr_repositories.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc-flowlog-bucket.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc-flowlog-bucket.data.aws_region.current: Read complete after 0s [id=ap-south-1]
data.aws_partition.current: Read complete after 0s [id=aws]
module.vpn_credential_bucket.data.aws_region.current: Read complete after 0s [id=ap-south-1]
data.aws_iam_policy_document.flow_log_s3: Read complete after 0s [id=3703675914]
module.vpn_credential_bucket.data.aws_partition.current: Reading...
module.eks_cluster.data.aws_caller_identity.current: Reading...
module.vpn_credential_bucket.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpn_credential_bucket.data.aws_caller_identity.current: Reading...
module.eks_cluster.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
data.aws_availability_zones.available: Reading...
module.vpc-flowlog-bucket.data.aws_caller_identity.current: Reading...
module.eks_cluster.data.aws_partition.current: Reading...
module.eks_cluster.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks_cluster.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
data.aws_region.current: Read complete after 0s [id=ap-south-1]
module.ecr_repositories.data.aws_caller_identity.current: Read complete after 0s [id=793524670633]
module.ecr_repositories.data.aws_iam_policy_document.repository[0]: Reading...
module.ecr_repositories.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=1327625668]
module.eks_cluster.data.aws_caller_identity.current: Read complete after 0s [id=793524670633]
module.eks_cluster.data.aws_iam_session_context.current: Reading...
module.eks_cluster.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:sts::793524670633:assumed-role/Terraform-deployer-role/Terraform-deployer-role]
module.vpn_credential_bucket.data.aws_caller_identity.current: Read complete after 0s [id=793524670633]
data.aws_availability_zones.available: Read complete after 1s [id=ap-south-1]
module.vpc-flowlog-bucket.data.aws_caller_identity.current: Read complete after 1s [id=793524670633]
data.aws_caller_identity.current: Read complete after 1s [id=793524670633]
module.vpc_endpoints.data.aws_vpc_endpoint_service.this["s3"]: Reading...
module.eks_cluster.module.eks_managed_node_group["SERVICES-NG"].data.aws_caller_identity.current: Reading...
module.eks_cluster.module.eks_managed_node_group["SERVICES-NG"].data.aws_partition.current: Reading...
module.eks_cluster.module.eks_managed_node_group["APPLICATION-NG"].data.aws_caller_identity.current: Reading...
module.eks_cluster.module.eks_managed_node_group["SERVICES-NG"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_cluster.module.eks_managed_node_group["APPLICATION-NG"].data.aws_partition.current: Reading...
module.eks_cluster.module.eks_managed_node_group["APPLICATION-NG"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_cluster.module.eks_managed_node_group["SERVICES-NG"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks_cluster.module.eks_managed_node_group["APPLICATION-NG"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks_cluster.module.eks_managed_node_group["APPLICATION-NG"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2460714259]
module.eks_cluster.module.eks_managed_node_group["SERVICES-NG"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2460714259]
module.vpc_endpoints.data.aws_vpc_endpoint_service.this["s3"]: Read complete after 0s [id=157916904]
module.eks_cluster.module.eks_managed_node_group["SERVICES-NG"].data.aws_caller_identity.current: Read complete after 0s [id=793524670633]
module.eks_cluster.module.eks_managed_node_group["APPLICATION-NG"].data.aws_caller_identity.current: Read complete after 0s [id=793524670633]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.kms_custom_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "kms_custom_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "kms:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "Enable IAM User Permissions"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::793524670633:root",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:CreateGrant",
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:GenerateDataKeyWithoutPlainText",
              + "kms:ReEncrypt*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "AllowAutoScalingServiceLinkedRole"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::793524670633:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:CreateGrant",
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "AllowEBSCSIRole"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:CreateGrant",
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "AllowEC2EBSService"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "793524670633",
                ]
              + variable = "kms:CallerAccount"
            }

          + principals {
              + identifiers = [
                  + "ec2.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "793524670633",
                ]
              + variable = "kms:CallerAccount"
            }

          + principals {
              + identifiers = [
                  + "elasticfilesystem.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_eip.vpn-eip will be created
  + resource "aws_eip" "vpn-eip" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Gateway"
          + "Managedby"     = "Workmates"
          + "Name"          = "project-prod-PRITUNL-EIP"
          + "Project"       = "project"
        }
      + tags_all             = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Gateway"
          + "Managedby"     = "Workmates"
          + "Name"          = "project-prod-PRITUNL-EIP"
          + "Project"       = "project"
        }
      + vpc                  = (known after apply)
    }

  # aws_iam_policy.ebs-kms-policy will be created
  + resource "aws_iam_policy" "ebs-kms-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "ebs-kms-policy"
      + id               = (known after apply)
      + name             = "project-prod-ebs-kms"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:DescribeKey",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment"   = "Prod"
          + "Implementedby" = "Workmates"
          + "Managedby"     = "Workmates"
          + "Project"       = "project"
        }
    }

  # aws_iam_policy.node-kms-policy will be created
  + resource "aws_iam_policy" "node-kms-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM Policy for Node KMS Access"
      + id               = (known after apply)
      + name             = "project-prod-node-kms"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:DescribeKey",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment"   = "Prod"
          + "Implementedby" = "Workmates"
          + "Managedby"     = "Workmates"
          + "Project"       = "project"
        }
    }

  # aws_iam_policy.node_additional will be created
  + resource "aws_iam_policy" "node_additional" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = " node additional policy for kms"
      + id               = (known after apply)
      + name             = "POC-EKS-ADDITIONAL"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Kubernetes"
          + "Managedby"     = "Workmates"
          + "Project"       = "project"
        }
      + tags_all         = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Kubernetes"
          + "Managedby"     = "Workmates"
          + "Project"       = "project"
        }
    }

  # aws_iam_role.ebs_csi_driver_role will be created
  + resource "aws_iam_role" "ebs_csi_driver_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "project-prod-ebs-csi-driver"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment"   = "Prod"
          + "Implementedby" = "Workmates"
          + "Managedby"     = "Workmates"
          + "Project"       = "project"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.efs_csi_driver_role will be created
  + resource "aws_iam_role" "efs_csi_driver_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "project-prod-efs-csi-driver"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment"   = "Prod"
          + "Implementedby" = "Workmates"
          + "Managedby"     = "Workmates"
          + "Project"       = "project"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.ebs_csi_driver_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "ebs_csi_driver_policy_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"
      + role       = "project-prod-ebs-csi-driver"
    }

  # aws_iam_role_policy_attachment.ebs_kms_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "ebs_kms_policy_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "project-prod-ebs-csi-driver"
    }

  # aws_iam_role_policy_attachment.efs_csi_driver_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "efs_csi_driver_policy_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEFSCSIDriverPolicy"
      + role       = "project-prod-efs-csi-driver"
    }

  # aws_key_pair.vpn_ec2_keypair will be created
  + resource "aws_key_pair" "vpn_ec2_keypair" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "project-Pritunl-VPN-1a-keypair"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags_all        = {
          + "Environment"   = "Prod"
          + "Implementedby" = "Workmates"
          + "Managedby"     = "Workmates"
          + "Project"       = "project"
        }
    }

  # aws_s3_bucket_lifecycle_configuration.vpc_flowlog_lifecycle will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "vpc_flowlog_lifecycle" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "project_vpc_flowlogs_lifecycle"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 15
              + expired_object_delete_marker = false
            }

          + filter {
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_object.vpn_private_key will be created
  + resource "aws_s3_object" "vpn_private_key" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "project-prod-pritunl-creds"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content                = (sensitive value)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "key-pairs/project-Pritunl-VPN-1a-keypair.pem"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Environment"   = "Prod"
          + "Implementedby" = "Workmates"
          + "Managedby"     = "Workmates"
          + "Project"       = "project"
        }
      + version_id             = (known after apply)
    }

  # tls_private_key.vpn_ec2_key will be created
  + resource "tls_private_key" "vpn_ec2_key" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.acm_main.aws_acm_certificate.this[0] will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "biswa.click"
      + domain_validation_options = [
          + {
              + domain_name           = "*.biswa.click"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "biswa.click"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.biswa.click",
          + "biswa.click",
        ]
      + tags                      = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "SSL"
          + "Managedby"     = "Workmates"
          + "Name"          = "biswa.click"
          + "Project"       = "project"
        }
      + tags_all                  = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "SSL"
          + "Managedby"     = "Workmates"
          + "Name"          = "biswa.click"
          + "Project"       = "project"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options {
          + certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.db_subnet_group.aws_db_subnet_group.this[0] will be created
  + resource "aws_db_subnet_group" "this" {
      + arn                     = (known after apply)
      + description             = "Project-Prod-Rds-Subnet-Grp-Prod Subnet group"
      + id                      = (known after apply)
      + name                    = "project-prod-rds-subnet-grp-prod"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "DB"
          + "Managedby"     = "Workmates"
          + "Name"          = "project-prod-rds-subnet-grp-prod"
          + "Project"       = "project"
        }
      + tags_all                = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "DB"
          + "Managedby"     = "Workmates"
          + "Name"          = "project-prod-rds-subnet-grp-prod"
          + "Project"       = "project"
        }
      + vpc_id                  = (known after apply)
    }

  # module.ec2_pritunl.data.aws_iam_policy_document.assume_role_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + sid     = "EC2AssumeRole"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Service"
            }
        }
    }

  # module.ec2_pritunl.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.ec2_pritunl.aws_iam_instance_profile.this[0] will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "project-prod-PRITUNL"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "project-prod-PRITUNL"
      + tags        = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Gateway"
          + "Managedby"     = "Workmates"
          + "Project"       = "project"
        }
      + tags_all    = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Gateway"
          + "Managedby"     = "Workmates"
          + "Project"       = "project"
        }
      + unique_id   = (known after apply)
    }

  # module.ec2_pritunl.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "project-prod-PRITUNL"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Gateway"
          + "Managedby"     = "Workmates"
          + "Project"       = "project"
        }
      + tags_all              = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Gateway"
          + "Managedby"     = "Workmates"
          + "Project"       = "project"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ec2_pritunl.aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryS3ReadOnlyAccess"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + role       = "project-prod-PRITUNL"
    }

  # module.ec2_pritunl.aws_iam_role_policy_attachment.this["AmazonSSMManagedInstanceCore"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "project-prod-PRITUNL"
    }

  # module.ec2_pritunl.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-019715e0d74f695be"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = "ap-south-1a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = false
      + disable_api_termination              = false
      + ebs_optimized                        = true
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "project-prod-PRITUNL"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "project-Pritunl-VPN-1a-keypair"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = false
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Gateway"
          + "Managedby"     = "Workmates"
          + "Name"          = "project-prod-PRITUNL"
          + "Project"       = "project"
        }
      + tags_all                             = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Gateway"
          + "Managedby"     = "Workmates"
          + "Name"          = "project-prod-PRITUNL"
          + "Project"       = "project"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "449586c290aeb64be279066f81611810768280e2"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + credit_specification {}

      + ebs_block_device (known after apply)

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = {
              + "Name" = "project-prod-PRITUNL-OS"
            }
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 20
          + volume_type           = "gp3"
        }

      + timeouts {}
    }

  # module.ecr_repositories.aws_ecr_lifecycle_policy.this["project-prod-asset-service"] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep lastest 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "project-prod-asset-service"
    }

  # module.ecr_repositories.aws_ecr_lifecycle_policy.this["project-prod-gateway-service"] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep lastest 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "project-prod-gateway-service"
    }

  # module.ecr_repositories.aws_ecr_lifecycle_policy.this["project-prod-loan-request-service"] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep lastest 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "project-prod-loan-request-service"
    }

  # module.ecr_repositories.aws_ecr_lifecycle_policy.this["project-prod-master-data-service"] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep lastest 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "project-prod-master-data-service"
    }

  # module.ecr_repositories.aws_ecr_repository.this["project-prod-asset-service"] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "project-prod-asset-service"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Storage"
          + "Managedby"     = "Workmates"
          + "Name"          = "project-prod-asset-service"
          + "Project"       = "project"
        }
      + tags_all             = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Storage"
          + "Managedby"     = "Workmates"
          + "Name"          = "project-prod-asset-service"
          + "Project"       = "project"
        }

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr_repositories.aws_ecr_repository.this["project-prod-gateway-service"] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "project-prod-gateway-service"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Storage"
          + "Managedby"     = "Workmates"
          + "Name"          = "project-prod-gateway-service"
          + "Project"       = "project"
        }
      + tags_all             = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Storage"
          + "Managedby"     = "Workmates"
          + "Name"          = "project-prod-gateway-service"
          + "Project"       = "project"
        }

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr_repositories.aws_ecr_repository.this["project-prod-loan-request-service"] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "project-prod-loan-request-service"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Storage"
          + "Managedby"     = "Workmates"
          + "Name"          = "project-prod-loan-request-service"
          + "Project"       = "project"
        }
      + tags_all             = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Storage"
          + "Managedby"     = "Workmates"
          + "Name"          = "project-prod-loan-request-service"
          + "Project"       = "project"
        }

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr_repositories.aws_ecr_repository.this["project-prod-master-data-service"] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "project-prod-master-data-service"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Storage"
          + "Managedby"     = "Workmates"
          + "Name"          = "project-prod-master-data-service"
          + "Project"       = "project"
        }
      + tags_all             = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Storage"
          + "Managedby"     = "Workmates"
          + "Name"          = "project-prod-master-data-service"
          + "Project"       = "project"
        }

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr_repositories.aws_ecr_repository_policy.this["project-prod-asset-service"] will be created
  + resource "aws_ecr_repository_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:ListTagsForResource",
                          + "ecr:ListImages",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetLifecyclePolicyPreview",
                          + "ecr:GetLifecyclePolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:DescribeImageScanFindings",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::793524670633:root"
                        }
                      + Sid       = "PrivateReadOnly"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "project-prod-asset-service"
    }

  # module.ecr_repositories.aws_ecr_repository_policy.this["project-prod-gateway-service"] will be created
  + resource "aws_ecr_repository_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:ListTagsForResource",
                          + "ecr:ListImages",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetLifecyclePolicyPreview",
                          + "ecr:GetLifecyclePolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:DescribeImageScanFindings",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::793524670633:root"
                        }
                      + Sid       = "PrivateReadOnly"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "project-prod-gateway-service"
    }

  # module.ecr_repositories.aws_ecr_repository_policy.this["project-prod-loan-request-service"] will be created
  + resource "aws_ecr_repository_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:ListTagsForResource",
                          + "ecr:ListImages",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetLifecyclePolicyPreview",
                          + "ecr:GetLifecyclePolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:DescribeImageScanFindings",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::793524670633:root"
                        }
                      + Sid       = "PrivateReadOnly"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "project-prod-loan-request-service"
    }

  # module.ecr_repositories.aws_ecr_repository_policy.this["project-prod-master-data-service"] will be created
  + resource "aws_ecr_repository_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:ListTagsForResource",
                          + "ecr:ListImages",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetLifecyclePolicyPreview",
                          + "ecr:GetLifecyclePolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:DescribeImageScanFindings",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::793524670633:root"
                        }
                      + Sid       = "PrivateReadOnly"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "project-prod-master-data-service"
    }

  # module.efs.aws_efs_file_system.this[0] will be created
  + resource "aws_efs_file_system" "this" {
      + arn                     = (known after apply)
      + availability_zone_id    = (known after apply)
      + availability_zone_name  = (known after apply)
      + creation_token          = (known after apply)
      + dns_name                = (known after apply)
      + encrypted               = true
      + id                      = (known after apply)
      + kms_key_id              = (known after apply)
      + name                    = (known after apply)
      + number_of_mount_targets = (known after apply)
      + owner_id                = (known after apply)
      + performance_mode        = "generalPurpose"
      + size_in_bytes           = (known after apply)
      + tags                    = {
          + "Env"           = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Storage"
          + "Managedby"     = "Workmates"
          + "Name"          = "project-prod-efs"
          + "Project"       = "project"
        }
      + tags_all                = {
          + "Env"           = "PROD"
          + "Environment"   = "Prod"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Storage"
          + "Managedby"     = "Workmates"
          + "Name"          = "project-prod-efs"
          + "Project"       = "project"
        }
      + throughput_mode         = "bursting"

      + protection (known after apply)
    }

  # module.efs.aws_efs_mount_target.this["ap-south-1a"] will be created
  + resource "aws_efs_mount_target" "this" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = (known after apply)
    }

  # module.efs.aws_efs_mount_target.this["ap-south-1b"] will be created
  + resource "aws_efs_mount_target" "this" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = (known after apply)
    }

  # module.efs.aws_efs_mount_target.this["ap-south-1c"] will be created
  + resource "aws_efs_mount_target" "this" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = (known after apply)
    }

  # module.efs_security_group.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Project-Prod Security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.173.0.0/16",
                ]
              + from_port        = 2049
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 2049
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "Project-Prod-SG"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Env"           = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Storage"
          + "Managedby"     = "Workmates"
          + "Name"          = "Project-Prod-SG"
          + "Project"       = "project"
        }
      + tags_all               = {
          + "Env"           = "PROD"
          + "Environment"   = "Prod"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Storage"
          + "Managedby"     = "Workmates"
          + "Name"          = "Project-Prod-SG"
          + "Project"       = "project"
        }
      + vpc_id                 = (known after apply)
    }

  # module.eks_cluster.data.aws_eks_addon_version.this["coredns"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "coredns"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + version            = (known after apply)
    }

  # module.eks_cluster.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "kube-proxy"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + version            = (known after apply)
    }

  # module.eks_cluster.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + version            = (known after apply)
    }

  # module.eks_cluster.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks_cluster.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/eks/POC-prod-EKS-CLUSTER/cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags              = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Kubernetes"
          + "Managedby"     = "Workmates"
          + "Name"          = "/aws/eks/POC-prod-EKS-CLUSTER/cluster"
          + "Project"       = "project"
        }
      + tags_all          = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Kubernetes"
          + "Managedby"     = "Workmates"
          + "Name"          = "/aws/eks/POC-prod-EKS-CLUSTER/cluster"
          + "Project"       = "project"
        }
    }

  # module.eks_cluster.aws_ec2_tag.cluster_primary_security_group["Environment"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Environment"
      + resource_id = (known after apply)
      + value       = "PROD"
    }

  # module.eks_cluster.aws_ec2_tag.cluster_primary_security_group["Implementedby"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Implementedby"
      + resource_id = (known after apply)
      + value       = "Workmates"
    }

  # module.eks_cluster.aws_ec2_tag.cluster_primary_security_group["Layer"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Layer"
      + resource_id = (known after apply)
      + value       = "Kubernetes"
    }

  # module.eks_cluster.aws_ec2_tag.cluster_primary_security_group["Managedby"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Managedby"
      + resource_id = (known after apply)
      + value       = "Workmates"
    }

  # module.eks_cluster.aws_ec2_tag.cluster_primary_security_group["Project"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Project"
      + resource_id = (known after apply)
      + value       = "project"
    }

  # module.eks_cluster.aws_eks_access_entry.this["admin-support-role"] will be created
  + resource "aws_eks_access_entry" "this" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "POC-prod-EKS-CLUSTER"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::836397457870:role/Workmates-SSO-AdminRole"
      + tags              = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Kubernetes"
          + "Managedby"     = "Workmates"
          + "Project"       = "project"
        }
      + tags_all          = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Kubernetes"
          + "Managedby"     = "Workmates"
          + "Project"       = "project"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks_cluster.aws_eks_access_entry.this["cluster_creator"] will be created
  + resource "aws_eks_access_entry" "this" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "POC-prod-EKS-CLUSTER"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::793524670633:role/Terraform-deployer-role"
      + tags              = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Kubernetes"
          + "Managedby"     = "Workmates"
          + "Project"       = "project"
        }
      + tags_all          = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Kubernetes"
          + "Managedby"     = "Workmates"
          + "Project"       = "project"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks_cluster.aws_eks_access_entry.this["ec2-role"] will be created
  + resource "aws_eks_access_entry" "this" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "POC-prod-EKS-CLUSTER"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::836397457870:role/CWMManagedInstanceRole"
      + tags              = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Kubernetes"
          + "Managedby"     = "Workmates"
          + "Project"       = "project"
        }
      + tags_all          = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Kubernetes"
          + "Managedby"     = "Workmates"
          + "Project"       = "project"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks_cluster.aws_eks_access_entry.this["l2-support-role"] will be created
  + resource "aws_eks_access_entry" "this" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "POC-prod-EKS-CLUSTER"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::836397457870:role/Workmates-SSO-L2SupportRole"
      + tags              = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Kubernetes"
          + "Managedby"     = "Workmates"
          + "Project"       = "project"
        }
      + tags_all          = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Kubernetes"
          + "Managedby"     = "Workmates"
          + "Project"       = "project"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks_cluster.aws_eks_access_policy_association.this["admin-support-role_admin-view"] will be created
  + resource "aws_eks_access_policy_association" "this" {
      + associated_at = (known after apply)
      + cluster_name  = "POC-prod-EKS-CLUSTER"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::836397457870:role/Workmates-SSO-AdminRole"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.eks_cluster.aws_eks_access_policy_association.this["cluster_creator_admin"] will be created
  + resource "aws_eks_access_policy_association" "this" {
      + associated_at = (known after apply)
      + cluster_name  = "POC-prod-EKS-CLUSTER"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::793524670633:role/Terraform-deployer-role"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.eks_cluster.aws_eks_access_policy_association.this["ec2-role_cluster-admin"] will be created
  + resource "aws_eks_access_policy_association" "this" {
      + associated_at = (known after apply)
      + cluster_name  = "POC-prod-EKS-CLUSTER"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::836397457870:role/CWMManagedInstanceRole"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.eks_cluster.aws_eks_access_policy_association.this["l2-support-role_admin-view"] will be created
  + resource "aws_eks_access_policy_association" "this" {
      + associated_at = (known after apply)
      + cluster_name  = "POC-prod-EKS-CLUSTER"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::836397457870:role/Workmates-SSO-L2SupportRole"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.eks_cluster.aws_eks_addon.before_compute["vpc-cni"] will be created
  + resource "aws_eks_addon" "before_compute" {
      + addon_name                  = "vpc-cni"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "POC-prod-EKS-CLUSTER"
      + configuration_values        = jsonencode(
            {
              + env = {
                  + ENABLE_PREFIX_DELEGATION = "true"
                  + WARM_PREFIX_TARGET       = "1"
                }
            }
        )
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Kubernetes"
          + "Managedby"     = "Workmates"
          + "Project"       = "project"
        }
      + tags_all                    = {
          + "Environment"   = "PROD"
          + "Implementedby" = "Workmates"
          + "Layer"         = "Kubernetes"
          + "Managedby"     = "Workmates"
          + "Project"       = "project"
        }

      + timeouts {}
    }

  # module.eks_cluster.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "coredns"
      + addon_version               = (known after apply)
      

...Output truncated...
```

</details>

---

 *Triggered by: @biswaranjan9937 using `pull_request`*
